
Функция ЛотыlotsGET(Запрос)
	
	ЗапросКБазе = Новый Запрос;
	ЗапросКБазе.Текст = 
	  "ВЫБРАТЬ
	  |	Лоты.Наименование КАК Наименование,
	  |	Лоты.Состояние КАК Состояние,
	  |	Лоты.Статус КАК Статус,
	  |	Лоты.Размер КАК Размер,
	  |	Лоты.Продавец КАК Продавец,
	  |	Лоты.Цена КАК Цена,
	  |	Лоты.Ссылка КАК Ссылка,
	  |	Контрагенты.Наименование КАК Наименование1,
	  |	Размеры.Наименование КАК Наименование2,
	  |	Лоты.ПутьККартинке КАК ПутьККартинке
	  |ИЗ
	  |	Справочник.Лоты КАК Лоты
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	  |		ПО Лоты.Продавец = Контрагенты.Ссылка
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Размеры КАК Размеры
	  |		ПО Лоты.Размер = Размеры.Ссылка
	  |ГДЕ
	  |	Лоты.Статус = &ПараметрыСтатус";
	
	 ЗапросКБазе.УстановитьПараметр("ПараметрыСтатус", Перечисления.СтатусыЛотов.Опубликован);
	 
	 РезультатЗапроса = ЗапросКБазе.Выполнить();
	 
	
	 Выборка = РезультатЗапроса.Выбрать();
	 
	 МассивДляЛотов = Новый Массив;
	 
	 Пока Выборка.Следующий()Цикл
		 ЛотGUID = Строка(Выборка.Ссылка.УникальныйИдентификатор()); //
		 
		 СтруктураДляЛотов = Новый Структура("name,price,id,size,seller,condition,image_url", Выборка.Наименование, Выборка.Цена, ЛотGUID, Выборка.Наименование2, Выборка.Наименование1, Строка(Выборка.Состояние), Выборка.ПутьККартинке);

				 
		 
		 
	 МассивДляЛотов.Добавить(СтруктураДляЛотов);
	 
 КонецЦикла;
 
 ПараметрыФормата = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
 
 Запись = Новый ЗаписьJSON;
 Запись.УстановитьСтроку(ПараметрыФормата);
 ЗаписатьJSON(Запись, МассивДляЛотов);
 ТекстJSON = Запись.Закрыть(); 
 
 Ответ = Новый HTTPСервисОтвет(200);
 Ответ.УстановитьТелоИзСтроки(ТекстJSON, "UTF-8");
 	
	Возврат Ответ;   
	
КонецФункции

Функция ЛотыlotsPOST(Запрос)
	 СтрокаJSON = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	 ЧтениеЛота = Новый ЧтениеJSON;
	 ЧтениеЛота.УстановитьСтроку(СтрокаJSON);
	 
	 Попытка
		 ДанныеЛота = ПрочитатьJSON(ЧтениеЛота);
		 ЧтениеЛота.Закрыть();	 
		 
	 Исключение
		 ЧтениеЛота.Закрыть(); 
		 Ответ = Новый HTTPСервисОтвет(400);
		 Ответ.УстановитьТелоИзСтроки("Некорректный формат JSON", "UTF-8");
		 Возврат Ответ;
	 КонецПопытки;
	 
	 НовыйЛот = Справочники.Лоты.СоздатьЭлемент();
	 НовыйЛот.Цена = ДанныеЛота.price;
	 НовыйЛот.Размер = Справочники.Размеры.НайтиПоНаименованию(ДанныеЛота.size);
	 НоменклатураGUID = ДанныеЛота.nomenclature_id;
	 УИД_Номенклатуры = Новый УникальныйИдентификатор(НоменклатураGUID);
	 НовыйЛот.Владелец = Справочники.Номенклатура.ПолучитьСсылку(УИД_Номенклатуры);
	 
	 КонтрагентGUID = ДанныеЛота.seller_id;
	 УИД_Контрагента = Новый УникальныйИдентификатор(КонтрагентGUID);
	 НовыйЛот.Продавец = Справочники.Контрагенты.ПолучитьСсылку(УИД_Контрагента);
	 
	 НовыйЛот.Состояние = Перечисления.СостояниеТоваров[ДанныеЛота.condition];
	 НовыйЛот.Записать();
	 
	 Ответ = Новый HTTPСервисОтвет(201);
     СтруктураРезультата = Новый Структура("success,lot_id", Истина, Строка(НовыйЛот.Ссылка.УникальныйИдентификатор()));
	 Запись = Новый ЗаписьJSON;
	 Запись.УстановитьСтроку();
	 ЗаписатьJSON(Запись, СтруктураРезультата);
	 ТекстJSON = Запись.Закрыть();
	 
	 Ответ.УстановитьТелоИзСтроки(ТекстJSON, "UTF-8");
	 Возврат Ответ;
КонецФункции

Функция ЗаказыordersPOST(Запрос)
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	
	ЧтениеЗапроса = Новый ЧтениеJSON;
	ЧтениеЗапроса.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		ДанныеЗаказа = ПрочитатьJSON(ЧтениеЗапроса);
		ЧтениеЗапроса.Закрыть();	 
		 
		Исключение
		 ЧтениеЗапроса.Закрыть(); 
		 Ответ = Новый HTTPСервисОтвет(400);
		 Ответ.УстановитьТелоИзСтроки("Некорректный формат JSON", "UTF-8");
		 Возврат Ответ;
	 КонецПопытки;
	 
	 ЛотСсылкаGUID = ДанныеЗаказа.lot_id;
	 УИД_ЛотСсылка = Новый УникальныйИдентификатор(ЛотСсылкаGUID);
	 ЛотСсылка = Справочники.Лоты.ПолучитьСсылку(УИД_ЛотСсылка);
	 
	 ПокупательСсылкаGUID = ДанныеЗаказа.user_id;
	 УИД_ПокупательСсылка = Новый УникальныйИдентификатор(ПокупательСсылкаGUID);
	 ПокупательСсылка = Справочники.Контрагенты.ПолучитьСсылку(УИД_ПокупательСсылка);
	 
	 ЗапросКонтрагенты = Новый Запрос;
	 
	 ЗапросКонтрагенты.Текст =
	 "ВЫБРАТЬ
	 |	Контрагенты.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.Контрагенты КАК Контрагенты
	 |ГДЕ
	 |	Контрагенты.Ссылка = &Ссылка";
	 ЗапросКонтрагенты.УстановитьПараметр("Ссылка", ПокупательСсылка);
	 
	 Если ЗапросКонтрагенты.Выполнить().Пустой() Тогда
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Покупатель не найден. Проверьте GUID");
		Возврат Ответ; 
	 КонецЕсли;
	 
	 
	 
	 
	 НачатьТранзакцию();
	 
	 Попытка
		 
     Блокировка = Новый БлокировкаДанных;
	 ЭлементБлокировки = Блокировка.Добавить("Справочник.Лоты");
	 ЭлементБлокировки.УстановитьЗначение("Ссылка", ЛотСсылка);
	 ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	 Блокировка.Заблокировать();
	 
	 ЛотОбъект = ЛотСсылка.ПолучитьОбъект();
	 
	 Если ЛотОбъект = Неопределено Тогда
		 ОтменитьТранзакцию();
		 Ответ = Новый HTTPСервисОтвет(404);
		 Ответ.УстановитьТелоИзСтроки("Лот не найден. Проверьте GUID");
		 Возврат Ответ;
	 КонецЕсли;
	 
	 Если ЛотОбъект.Статус <> Перечисления.СтатусыЛотов.Опубликован Тогда
		 ОтменитьТранзакцию();
		 Ответ = Новый HTTPСервисОтвет(409);
		 Ответ.УстановитьТелоИзСтроки("Лот недоступен для покупки");
		 Возврат Ответ;
	 КонецЕсли;
	 
		 НовыйЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
		 
		 НовыйЗаказ.Дата = ТекущаяДатаСеанса();
		 НовыйЗаказ.Лот = ЛотСсылка;		 
		 НовыйЗаказ.Покупатель = ПокупательСсылка;		 
		 НовыйЗаказ.Сумма = ЛотОбъект.Цена;
		 
		 НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		 
	     ЗафиксироватьТранзакцию();
	 Исключение
		 ОтменитьТранзакцию();
		 Ответ = Новый HTTPСервисОтвет(500);
		 Ответ.УстановитьТелоИзСтроки("Отмена транзакции! " + ОписаниеОшибки());
		 Возврат Ответ;
	 КонецПопытки;
	 
		 
	СтруктураОтвета = Новый Структура("success,order_id", Истина, Строка(НовыйЗаказ.Ссылка.УникальныйИдентификатор()));
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, СтруктураОтвета);
	ТекстJSON = Запись.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(201);
	Ответ.УстановитьТелоИзСтроки(ТекстJSON, "UTF-8");
	Возврат Ответ;
КонецФункции

Функция ПользователиusersGET(Запрос)
	GUID_Пользователя = Запрос.ПараметрыЗапроса.Получить("user_id");
		
	Если GUID_Пользователя = Неопределено Или ПустаяСтрока(GUID_Пользователя) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Не указан обязательный параметр user_id");
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		УИД = Новый УникальныйИдентификатор(GUID_Пользователя);
		СсылкаКонтрагента = Справочники.Контрагенты.ПолучитьСсылку(УИД);
		
	РезультатАвторизации = СервисАвторизации.ПроверитьАвторизацию(Запрос, СсылкаКонтрагента);
	
	Если  Не РезультатАвторизации.Успех Тогда 
		Ответ = Новый HTTPСервисОтвет(РезультатАвторизации.КодСостояния);
		Ответ.УстановитьТелоИзСтроки(РезультатАвторизации.ТекстОшибки);
		Возврат Ответ;
	КонецЕсли;
		
	Исключение
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Некорректный формат параметра user_id");
		Возврат Ответ;
	КонецПопытки;
	
	ЗапросКБазе = Новый Запрос;
	ЗапросКБазе.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(БалансКонтрагентовОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БалансКонтрагентов.Остатки(, Контрагент = &Контрагент) КАК БалансКонтрагентовОстатки
	|		ПО Контрагенты.Ссылка = БалансКонтрагентовОстатки.Контрагент
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент";
	ЗапросКБазе.УстановитьПараметр("Контрагент", СсылкаКонтрагента);
	
	РезультатЗапроса = ЗапросКБазе.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Не удалось получить баланс пользователя");
		Возврат Ответ;
	Иначе
		СтруктураОтвета = Новый Структура("user_id,balance", GUID_Пользователя, Выборка.СуммаОстаток);
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, СтруктураОтвета);
		ТекстJSON = Запись.Закрыть();
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ТекстJSON, "UTF-8");
		Возврат Ответ;
	КонецЕсли;
	
КонецФункции

Функция ПодтверждениеДоставкиdeliveriesPOST(Запрос)
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();	 
		 
		Исключение
		 ЧтениеJSON.Закрыть(); 
		 Ответ = Новый HTTPСервисОтвет(400);
		 Ответ.УстановитьТелоИзСтроки("Некорректный формат JSON", "UTF-8");
		 Возврат Ответ;
	 КонецПопытки;
	 
	 Попытка
		 ЗаказGUID = ДанныеЗапроса.order_id;
		 УИД_Заказа = Новый УникальныйИдентификатор(ЗаказGUID);
	 Исключение
		 Ответ = Новый HTTPСервисОтвет(400);
		 Ответ.УстановитьТелоИзСтроки("Некорректный формат GUID");
		 Возврат Ответ;	 
	 КонецПопытки;
	 
		 ЗаказСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(УИД_Заказа);
		 ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
		 
		 Если ЗаказОбъект = Неопределено Тогда
			Ответ = Новый HTTPСервисОтвет(404);
			Ответ.УстановитьТелоИзСтроки("Такого заказа не существует, проверьте GUID");
		 	Возврат Ответ;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			НовоеПодтверждение = Документы.ПодтверждениеДоставки.СоздатьДокумент();
			//НовоеПодтверждение.Заполнить(ЗаказОбъект); ТОЛЬКО ПРИ НАЛИЧИИ ОБРАБОТКИ ЗАПОЛНЕНИЯ
			НовоеПодтверждение.Дата = ТекущаяДатаСеанса();
			НовоеПодтверждение.Лот = ЗаказОбъект.Лот;
			НовоеПодтверждение.Сумма = ЗаказОбъект.Сумма;
			НовоеПодтверждение.Продавец = ЗаказОбъект.Лот.Продавец;
			НовоеПодтверждение.Покупатель = ЗаказОбъект.Покупатель;
			НовоеПодтверждение.Сделка = ЗаказОбъект.Ссылка;
			
			НовоеПодтверждение.Записать(РежимЗаписиДокумента.Проведение);
			УИД_Подтверждения = Строка(НовоеПодтверждение.Ссылка.УникальныйИдентификатор());
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Ответ = Новый HTTPСервисОтвет(400);
		 	Ответ.УстановитьТелоИзСтроки("Документ не создан.", "UTF-8");
		 	Возврат Ответ;
		КонецПопытки;
		
		СтруктураОтвета = Новый Структура("confirm_id", УИД_Подтверждения);

		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, СтруктураОтвета);
		ТекстJSON = Запись.Закрыть();
		
		Ответ = Новый HTTPСервисОтвет(201);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ТекстJSON, "UTF-8");
		Возврат Ответ;
КонецФункции

Функция АунтефикацияpostAuthPOST(Запрос)
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка 
		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	
	Исключение
		ЧтениеJSON.Закрыть();
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Некорректный JSON", "UTF-8");
		Возврат Ответ;
	КонецПопытки;
		ЛогинJSON = "";
		ПарольJSON = "";
		
		Если Не ДанныеЗапроса.Свойство("login", ЛогинJSON) Или Не ДанныеЗапроса.Свойство("password", ПарольJSON) Или ПустаяСтрока(ЛогинJSON) Или ПустаяСтрока(ПарольJSON) Тогда 
			Ответ = Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки("Не указан логин или пароль", "UTF-8");
			Возврат Ответ;
		КонецЕсли;
					
		Хешер = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хешер.Добавить(ПарольJSON);
		ХешПароля = НРег(СтрЗаменить(Строка(Хешер.ХешСумма), " ", ""));
		
		ЗапросКБазе = Новый Запрос;
		ЗапросКБазе.Текст =
		"ВЫБРАТЬ
		|	Контрагенты.ХешПароля КАК ХешПароля,
		|	Контрагенты.Логин КАК Логин,
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ХешПароля = &ХешПароля
		|	И Контрагенты.Логин = &Логин";
		
		ЗапросКБазе.УстановитьПараметр("Логин", ЛогинJSON);
		ЗапросКБазе.УстановитьПараметр("ХешПароля", ХешПароля);
		
		РезультатЗапроса = ЗапросКБазе.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если НЕ Выборка.Следующий() Тогда
			Ответ = Новый HTTPСервисОтвет(401);
			Ответ.УстановитьТелоИзСтроки("Неверный логин или пароль.", "UTF-8");
			Возврат Ответ;
		КонецЕсли;
		
		НовыйТокен = "sec_" + СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
		МенеджерЗаписи = РегистрыСведений.КлючиДоступаAPI.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КлючДоступа = НовыйТокен;
		МенеджерЗаписи.Контрагент = Выборка.Ссылка;
		МенеджерЗаписи.Активен = Истина;
		МенеджерЗаписи.ДатаИстечения = ДобавитьМесяц(ТекущаяДатаСеанса(), 2);
		МенеджерЗаписи.Записать();
		
		
		GUID_Пользователя = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		СтруктураОтвета = Новый Структура("success,token,user_id", Истина, Строка(НовыйТокен), GUID_Пользователя);
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, СтруктураОтвета);
		ТекстJSON = Запись.Закрыть();
		
		ТокенОтвет = Новый HTTPСервисОтвет(200);
		ТокенОтвет.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		ТокенОтвет.УстановитьТелоИзСтроки(ТекстJSON, "UTF-8");
		Возврат ТокенОтвет;
КонецФункции


Функция РегистрацияregisterPOST(Запрос)
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		ЧтениеJSON.Закрыть();
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Некорректный JSON", "UTF-8");
		Возврат Ответ;
	КонецПопытки;
	
	ИмяJSON = "";
	ПарольJSON = "";
	ЛогинJSON = "";
	
	
	Если Не ДанныеЗапроса.Свойство("name", ИмяJSON) Или Не ДанныеЗапроса.Свойство("login", ЛогинJSON) Или Не ДанныеЗапроса.Свойство("password", ПарольJSON) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Не указано имя, пароль или лоин", "UTF-8");
		Возврат Ответ;
	КонецЕсли;
	
	ДопустимыеСимволы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789_.@-";

	Для Индекс = 1 По СтрДлина(ЛогинJSON) Цикл
		Символ = Сред(ЛогинJSON, Индекс, 1);
		Если Найти(ДопустимыеСимволы, Символ) = 0 Тогда
			Ответ = Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки("Логин может содержать только латинские буквы, цифры и символы _ . @ -", "UTF-8");
			Возврат Ответ;
		КонецЕсли;
	КонецЦикла;
	
	
	ЗапросКБазе = Новый Запрос;
	ЗапросКБазе.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Логин КАК Логин
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Логин = &Логин";
	
	
	ЗапросКБазе.УстановитьПараметр("Логин", ЛогинJSON);
	
	ДанныеЗапроса = ЗапросКБазе.Выполнить();
	Выборка = ДанныеЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Ответ = Новый HTTPСервисОтвет(409);
		Ответ.УстановитьТелоИзСтроки("Пользователь с таким логином уже существует", "UTF-8");
		Возврат Ответ;
	КонецЕсли;
	
	НовыйПользователь = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйПользователь.Логин = ЛогинJSON;
	НовыйПользователь.Наименование = ИмяJSON;
	
	Хешер = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хешер.Добавить(ПарольJSON);
	ХешПароляНовый = НРег(СтрЗаменить(Строка(Хешер.ХешСумма), " ", "")); //чтобы не было пробелов
	
	НовыйПользователь.ХешПароля = ХешПароляНовый;
	НовыйПользователь.Записать();
	
	НовыйТокен = "sec_" + СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	МенеджерЗаписи = РегистрыСведений.КлючиДоступаAPI.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлючДоступа = НовыйТокен;
	МенеджерЗаписи.Контрагент = НовыйПользователь.Ссылка;
	МенеджерЗаписи.Активен = Истина;
	МенеджерЗаписи.ДатаИстечения = ДобавитьМесяц(ТекущаяДатаСеанса(), 2);
	МенеджерЗаписи.Записать();
	
	СтруктураОтвет = Новый Структура("success,token,user_id", Истина, НовыйТокен, Строка(НовыйПользователь.Ссылка.УникальныйИдентификатор()));
	
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, СтруктураОтвет);
	ТекстJSON = Запись.Закрыть();
	
	
	РегистрацияОтвет = Новый HTTPСервисОтвет(200);
	РегистрацияОтвет.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	РегистрацияОтвет.УстановитьТелоИзСтроки(ТекстJSON, "UTF-8");
	Возврат РегистрацияОтвет;
КонецФункции


Функция СменаПароляchangePOST(Запрос)
	РезультатАвторизации = СервисАвторизации.ПроверитьАвторизацию(Запрос);
	АвторизованныйКонтрагент = РезультатАвторизации.Контрагент;
	
	Если Не РезультатАвторизации.Успех Тогда
		Ответ = Новый HTTPСервисОтвет(РезультатАвторизации.КодСостояния);
		Ответ.УстановитьТелоИзСтроки(РезультатАвторизации.ТекстОшибки, "UTF-8");
		Возврат Ответ;
	КонецЕсли;
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Неккоректный JSON", "UTF-8");
		Возврат Ответ;
	КонецПопытки;
	
	НовыйПароль = "";
	СтарыйПароль = "";
	
	Если Не ДанныеЗапроса.Свойство("new_password", НовыйПароль) Или Не ДанныеЗапроса.Свойство("old_password", СтарыйПароль) Или ПустаяСтрока(НовыйПароль) Или ПустаяСтрока(СтарыйПароль) Тогда 
		Ответ = Новый  HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Не указан old_password или new_password", "UTF-8");
		Возврат Ответ;
	КонецЕсли;
	
	Хешер = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хешер.Добавить(СтарыйПароль);
	ХешСтарогоПароля = НРег(СтрЗаменить(Строка(Хешер.ХешСумма), " ", ""));
	
	ХешерНовый = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешерНовый.Добавить(НовыйПароль);
	ХешНовогоПароля = НРег(СтрЗаменить(Строка(ХешерНовый.ХешСумма), " ", ""));
	
	КонтрагентОбъект = АвторизованныйКонтрагент.ПолучитьОбъект();
	
	Если КонтрагентОбъект = Неопределено Тогда 
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Пользователь не найден", "UTF-8");
		Возврат Ответ;
	КонецЕсли;
	
	Если КонтрагентОбъект.ХешПароля <> ХешСтарогоПароля Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Неверный старый пароль", "UTF-8");
		Возврат Ответ;
	КонецЕсли;
	
	КонтрагентОбъект.ХешПароля = ХешНовогоПароля;
	КонтрагентОбъект.Записать();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Пароль успешно сменен.", "UTF-8");
	Возврат Ответ;
КонецФункции


Функция ЗаказыordersGET(Запрос)
	РезультатАвторизации = СервисАвторизации.ПроверитьАвторизацию(Запрос);
	Покупатель = РезультатАвторизации.Контрагент;
	
	Если Не РезультатАвторизации.Успех Тогда
		Ответ = Новый HTTPСервисОтвет(РезультатАвторизации.КодСостояния);
		Ответ.УстановитьТелоИзСтроки(РезультатАвторизации.ТекстОшибки, "UTF-8");
		Возврат Ответ; 
	КонецЕсли; 
	
	ЗапросКБазе = Новый Запрос;
	
	ЗапросКБазе.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Номер КАК Номер,
	|	ЗаказПокупателя.Дата КАК Дата,
	|	ЗаказПокупателя.Проведен КАК Проведен,
	|	ЗаказПокупателя.Лот КАК Лот,
	|	ЗаказПокупателя.Покупатель КАК Покупатель,
	|	ЗаказПокупателя.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Покупатель = &Покупатель";
	
	ЗапросКБазе.УстановитьПараметр("Покупатель", Покупатель);
	Попытка
		РезультатЗапроса = ЗапросКБазе.Выполнить();
	Исключение
	     Ответ = Новый HTTPСервисОтвет(500);
		 Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки(), "UTF-8");
		 Возврат Ответ
	 КонецПопытки;
	 
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивЗаказов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СтруктураЗаказа = Новый Структура("order_id,date,number,total_price", Строка(Выборка.Ссылка.УникальныйИдентификатор()), Выборка.Дата, Выборка.Номер, Выборка.Сумма);
		МассивЗаказов.Добавить(СтруктураЗаказа);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивЗаказов);
	ТекстJSON = ЗаписьJSON.Закрыть();
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ТекстJSON);
	Возврат Ответ;
КонецФункции

