
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Документ ВыплатаПродавцу	
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.БалансКонтрагентов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Контрагент", Продавец);
	Блокировка.Заблокировать();
	
	ЗапросКБазе = Новый Запрос;
	ЗапросКБазе.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(БалансКонтрагентовОстатки.СуммаОстаток, 0) КАК СуммаОстаток1
	|ИЗ
	|	РегистрНакопления.БалансКонтрагентов.Остатки(, Контрагент = &Контрагент) КАК БалансКонтрагентовОстатки";
	ЗапросКБазе.УстановитьПараметр("Контрагент", Продавец);
	
	РезультатЗапроса = ЗапросКБазе.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ДоступныйБаланс = 0;
	
	Если Выборка.Следующий() Тогда
		ДоступныйБаланс = Выборка.СуммаОстаток1;
	КонецЕсли;
	
	Если Сумма > ДоступныйБаланс Тогда
		Отказ = Истина;
		ВызватьИсключение("Недостаточно средств для вывода");
	КонецЕсли;

	Движения.БалансКонтрагентов.Записывать = Истина;
	Движение = Движения.БалансКонтрагентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Продавец;
	Движение.Сумма = Сумма;
КонецПроцедуры
