Процедура ОбработкаПроведения(Отказ, РежимПроведенияДокумента)
    
    //Документ ЗаказПокупателя
	
    ЛотОбъект = Лот.ПолучитьОбъект();
    Если ЛотОбъект.Статус <> Перечисления.СтатусыЛотов.Опубликован Тогда
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    ЛотОбъект.Статус = Перечисления.СтатусыЛотов.Выкуплен;
    ЛотОбъект.Записать();
    
    Движения.ДенежныеСредстваВХолде.Записывать = Истина;
    Движение = Движения.ДенежныеСредстваВХолде.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Сделка = Ссылка;
    Движение.Покупатель = Покупатель;
    Движение.Сумма = Сумма;
КонецПроцедуры