Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Документ ПодтверждениеДоставки

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Лоты");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Лот);
	Блокировка.Заблокировать();
	
	ЛотОбъект = Лот.ПолучитьОбъект();
	
	Если ЛотОбъект.Статус <> Перечисления.СтатусыЛотов.Выкуплен Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Лот уже забрали, невозможно подтвердить доставку";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЛотОбъект.Статус = Перечисления.СтатусыЛотов.Доставлен;
	ЛотОбъект.Записать();
	
		Движения.ДенежныеСредстваВХолде.Записывать = Истина;
		Движение = Движения.ДенежныеСредстваВХолде.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сделка = Сделка;
		Движение.Покупатель = Покупатель;
		Движение.Сумма = Сумма;

		Движения.БалансКонтрагентов.Записывать = Истина;
		Движение = Движения.БалансКонтрагентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Продавец;
		Движение.Сумма = Сумма * 0.9;
КонецПроцедуры
