Процедура ПроверкаКлючей() Экспорт 
ТекущаяДата = ТекущаяДатаСеанса();
ЗапросКБазе = Новый Запрос;
ЗапросКБазе.Текст = 
"ВЫБРАТЬ
|	КлючиДоступаAPI.Активен КАК Активен,
|	КлючиДоступаAPI.ДатаИстечения КАК ДатаИстечения,
|	КлючиДоступаAPI.КлючДоступа КАК КлючДоступа
|ИЗ
|	РегистрСведений.КлючиДоступаAPI КАК КлючиДоступаAPI
|ГДЕ
|	КлючиДоступаAPI.Активен = Истина
|	И КлючиДоступаAPI.ДатаИстечения < &ТекущаяДата";

ЗапросКБазе.УстановитьПараметр("ТекущаяДата", ТекущаяДата);

РезультатЗапроса = ЗапросКБазе.Выполнить();
Выборка = РезультатЗапроса.Выбрать();

Пока Выборка.Следующий() Цикл
	МенеджерЗаписи = РегистрыСведений.КлючиДоступаAPI.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлючДоступа = Выборка.КлючДоступа;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Активен = Ложь;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецЦикла;




КонецПроцедуры

