Функция ПроверитьАвторизацию(ЗапросHTTP, ЗапрашиваемыйКонтрагент = Неопределено) Экспорт
	КлючДоступа = ЗапросHTTP.Заголовки.Получить("X-API-Key");
	Если КлючДоступа = Неопределено Тогда
			КлючДоступа = ЗапросHTTP.Заголовки.Получить("x-api-key");
	КонецЕсли;
		
	Если КлючДоступа = Неопределено Или ПустаяСтрока(КлючДоступа) Тогда
			СтруктураОтвета = Новый Структура("Успех, ТекстОшибки, КодСостояния", Ложь, "Не передан X-API-Key", 401);
			Возврат СтруктураОтвета;
	КонецЕсли;
		
	ЗапросКБазе = Новый Запрос;
	ЗапросКБазе.Текст = 
	"ВЫБРАТЬ
	|	КлючиДоступаAPI.КлючДоступа КАК КлючДоступа,
	|	КлючиДоступаAPI.Контрагент КАК Контрагент,
	|	КлючиДоступаAPI.ДатаИстечения КАК ДатаИстечения,
	|	КлючиДоступаAPI.Активен КАК Активен
	|ИЗ
	|	РегистрСведений.КлючиДоступаAPI КАК КлючиДоступаAPI
	|ГДЕ
	|	КлючиДоступаAPI.КлючДоступа = &КлючДоступа";
	
	ЗапросКБазе.УстановитьПараметр("КлючДоступа", КлючДоступа);
	РезультатЗапроса = ЗапросКБазе.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
			СтруктураОтвета = Новый Структура("Успех, ТекстОшибки, КодСостояния", Ложь, "Не действительный API-ключ", 401);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		Если Не Выборка.Активен Тогда
			СтруктураОтвета = Новый Структура("Успех, ТекстОшибки, КодСостояния", Ложь, "API-ключ деактивирован", 401);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаИстечения) И ТекущаяДатаСеанса() > Выборка.ДатаИстечения Тогда
			СтруктураОтвета = Новый Структура("Успех, ТекстОшибки, КодСостояния", Ложь, "Срок действия API-ключа истек", 401);
			Возврат СтруктураОтвета;
			
		КонецЕсли;
		
		АвторизованныйКонтрагент = Выборка.Контрагент;
		
		Если ЗначениеЗаполнено(ЗапрашиваемыйКонтрагент) и ЗапрашиваемыйКонтрагент <> АвторизованныйКонтрагент Тогда
			СтруктураОтвета = Новый Структура("Успех, ТекстОшибки, КодСостояния", Ложь, "Доступ к чужим данным запрещен", 403);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		СтруктураОтвета = Новый Структура("Успех, Контрагент, КодСостояния", Истина, АвторизованныйКонтрагент, 200);
        Возврат СтруктураОтвета; 		
КонецФункции
